main_menu = {
            0: "Главное меню",
            1: "Открыть книгу",
            2: "Сохранить книгу",
            3: "Показать все контакты",
            4: "Создать новый контакт",
            5: "Найти контакт",
            6: "Изменить контакт",
            7: "Удалить контакт",
            8: "Выйти из программы",
        }

choice_main_menu = f'Выберите пункт меню (от 1 до {len(main_menu)-1}): '
mistake_input = 'Неверный ввод, попробуйте снова!'


phone_book_opened_successfully = 'Телефонная книга отркыта успешно!'
phone_book_saved_successfully = 'Телефонная книга сохранена успешно!'
